{
  "about": {
    "text": "I'm an electrical engineering and computer science major at Rice University. My interests lie in both fields: my coursework focuses on theoretical and practical electrical engineering, and my industry experience lies exclusively in software engineering.\n\nI have interests in front-facing consumer software (working at all levels of the stack, from frontend JavaScript to maintaining Elasticsearch clusters), GPU computation and parallelized manipulation of massive data sets (especially with the NVIDIA CUDA framework), and system administration (personally maintaining a Linux web, mail, file synchronization, and CI server). Please visit <a class=\"link\" href=\"projects\">Projects</a> for some of my previous work.\n\nDetails of my experience in the software engineering industry can be found at <a class=\"link\" href=\"experience\">Industry Experience</a>.\n\nWant to get in touch? You can find my email in my resume."
  },
  "industry_experience": [
    {
      "company": "Uber",
      "location": "San Francisco, CA",
      "year": 2016,
      "title": "Software Engineer Intern",
      "text": "Pending: expected to start May 2016",
      "links": [
        {
          "name": "company website",
          "url": "https://www.uber.com"
        }
      ]
    },
    {
      "company": "Yelp",
      "location": "San Francisco, CA",
      "year": 2015,
      "title": "Software Engineer Intern",
      "text": "Designed and built an email campaign system to increase reviews from users who order off Yelp Platform.\nAs a side project, developed an internal command line interface for developers to order coffee from the Yelp cafe.\nRedesigned and implemented a new user interface for Yelp's business photos uploader.",
      "links": [
        {
          "name": "company website",
          "url": "https://www.yelp.com"
        }
      ]
    }
  ],
  "projects": [
    {
      "title": "Modern Paste",
      "year": "2016",
      "text": "A powerful, open-source Pastebin alternative intended for self-hosted deployments. Modern Paste is a contemporary, Python-powered web application featuring functionality standard for a code/text sharing application, including user account integration, syntax highlighting, security restrictions and visibility control, and a RESTful API for programmatic integration into existing applications.",
      "links": [
        {
          "name": "website",
          "url": "https://www.modernpaste.com/"
        },
        {
          "name": "demo",
          "url": "https://demo.modernpaste.com/"
        },
        {
          "name": "github",
          "url": "https://github.com/LINKIWI/modern-paste"
        }
      ]
    },
    {
      "title": "GPU Acceleration of Edge-Based Motion Detection and Machine Learning-Aided Facial Recognition with NVIDIA CUDA",
      "year": "2015",
      "text": "An exploration of GPU-CPU speedup achieved with parallelized edge detection, motion detection, and facial recognition algorithms with the NVIDIA CUDA framework.",
      "links": [
        {
          "name": "full paper",
          "url": "../static/pdf/cuda-computer-vision.pdf"
        },
        {
          "name": "poster",
          "url": "../static/pdf/cuda-computer-vision-poster.pdf"
        },
        {
          "name": "github",
          "url": "https://github.com/LINKIWI/cuda-computer-vision"
        }
      ]
    },
    {
      "title": "SignAuth",
      "year": "2015",
      "text": "SignAuth adds an additional layer of security to web applications with two-factor authentication in the form of a precise, touch-based signature from the user, in addition to a standard username and password. Its security depends on a configurable-threshold match of speed, drawing path, and pressure, all of which are validated with custom algorithms.",
      "links": [
        {
          "name": "github",
          "url": "https://github.com/LINKIWI/sign-auth"
        },
        {
          "name": "featured on the sensel developer website",
          "url": "http://www.sensel.com/developers/"
        },
        {
          "name": "video demo",
          "url": "https://vimeo.com/140278654"
        }
      ]
    },
    {
      "title": "Mind Versus Might",
      "year": "2015",
      "text": "Designed and built a robotic arm-wrestling game controlled by the player's brain waves, as read by a Muse headband. Raw EEG data is sent via Bluetooth to an Android app, which processes the information and remotely sends data to an Arduino controlling a motor on a custom-built arm-wrestling mechanism.",
      "links": [
        {
          "name": "github",
          "url": "https://github.com/Abhipray/MindVsMuscle"
        }
      ]
    },
    {
      "title": "SecureTap",
      "year": "2015",
      "text": "HackRice 2015 winner: best hardware hack\nAndroid, Arduino, and Flask web API application for securely and automatically authenticating online accounts with a tap of an RFID card on an Arduino-controlled sensor, communicating with a windows PC via USB.",
      "links": [
        {
          "name": "github",
          "url": "https://github.com/LINKIWI/SecureTap"
        },
        {
          "name": "video demo",
          "url": "https://www.youtube.com/watch?v=_zQl5AL21Q8"
        }
      ]
    },
    {
      "title": "Around the World in 80 Days",
      "year": "2015",
      "text": "The traveling salesman problem on a literally global scale with the world's most popular travel destinations. Flask web application implementing a visualization of a modified A* traversal algorithm (using the Google Maps JS API) on a graph representing flights to and from the world's most popular tourist cities, using live flight data from Sabre's flight API. Built at HackDFW 2015 in less than 24 hours.",
      "links": [
        {
          "name": "github",
          "url": "https://github.com/LINKIWI/AroundTheWorldIn80Days"
        },
        {
          "name": "web app link",
          "url": "http://aroundtheworldin80days.us/"
        }
      ]
    },
    {
      "title": "Mobile Manager for CloudFlare",
      "year": "2014",
      "text": "Developed and actively improving a native Android mobile application providing website administrators an interface for configuring CloudFlare's content delivery network options for their domains. 3000+ downloads.",
      "links": [
        {
          "name": "github",
          "url": "https://github.com/LINKIWI/MobileManagerforCloudFlare"
        },
        {
          "name": "information website",
          "url": "https://www.cloudflaremanager.com"
        },
        {
          "name": "play store link",
          "url": "https://play.google.com/store/apps/details?id=info.kevinlin.cloudflaremanager"
        }
      ]
    }
  ]
}
